namespace ITLT.UnitTests.DesignChecking
{
    using ITLT.Data.Classes;
    using ITLT.Data.Classes.References;
    using NUnit.Framework;
    using System;
    using System.Collections.Generic;
    using System.Diagnostics;
    using System.Linq;
    using System.Reflection;
    using System.Text;

    /// <summary>
    /// Checking of Design of Classes
    /// </summary>
    public class StringTests : NUnitBaseTests
    {

        #region Private && Protected Fields 

        #endregion

        #region MyRegion

        public StringTests()
        {

        }

        #endregion

        #region Public Methods

        [Test]
        public void ReferenceDesignCheckingTest()
        {
            var arr = SourceData.Split(new[] { '\n' }).ToList();

            var checks = new Dictionary<string, List<string>>();
            var check = new List<string>();
            int i = 1;

            foreach (var item in arr)
            {
                var str = item.Trim();
                if (str == ";;;")
                {
                    if (check.Count > 0) 
                    {
                        checks.Add((i++).ToString(), new List<string>(check));
                        check.Clear();
                    }
                }
                else if (str != string.Empty)
                {
                    check.Add(str);
                }
            }

            foreach (var number in checks.Keys)
            {
                Debug.WriteLine(number);
                check = checks[number];
                foreach (var str in check) 
                {
                    var values = str.Split(';');
                    Debug.WriteLine("    " + str);
                    Debug.WriteLine($"name = {values[0]} - cash: {values[1]} - not cash: {values[2]} ");
                    Debug.WriteLine("    " + Double.Parse(string.IsNullOrWhiteSpace(values[1]) ? "0,00" : values[1].Replace(" ","")));

                    var id = Guid.NewGuid(); 
                    var date = DateTimeOffset.UtcNow;
                    var name = values[0];
                    var amount = Double.Parse(string.IsNullOrWhiteSpace(values[1]) ? "0,00" : values[1].Replace(" ", ""));
                    var checkNumber = number;
                    var cash = true;

                    var query =  $@"
                        INSERT INTO [dbo].[InvoiceInSrcs]
                           ([Id]
                           ,[Date]
                           ,[CheckNumber]
                           ,[Name]
                           ,[Quantity]
                           ,[Price]
                           ,[Amount]
                           ,[Cash])
                         VALUES
                               ('{id}'
                               ,'{date}'
                               ,'{checkNumber}'
                               ,'{name}'
                               ,{1.00}
                               ,{0.00}
                               ,{amount}
                               ,{ (cash ? '1' : '0')})
                        ";

                    Debug.WriteLine("    " + query);
                }
            }
        }

        private string SourceData => @"
            Витамины Омега + Q10;560,00;;
            Бензин;1 866,00;;
            Напитки;195,00;;
            Метро;8 912,00;;
            Ботинки Гриспорт;3 851,00;;
            Майки;1 834,00;;
            Адам-ДР;3 000,00;;
            Адам-ДР;5 000,00;;
            ;;;
            Формирователь десны;10 000,00 ;;
            Яблоко;959,00 ;;
            Яблоко;865,00 ;;
            МТС;;500,00 ;
            Автокафе;335,00 ;;
            Яблоко;436,00 ;;
            Маршрутка;17,00 ;;
            Троллейбус;17,00 ;;
            Благотворительность;50,00 ;;
            Адам - карманные;350,00 ;;
            Артур - карманные;200,00 ;;
            Кафе в Бахчисарае;1 800,00 ;;
            ;;;
            Омега-3-6-9;619,00 ;;
            Витамины для глаз;481,00 ;;
            Эссенциальные фосфолипиды;481,00 ;;
            Гроприносин;1 356,00 ;;
            Мультитабс детск.;437,00 ;;
            Нурофен;149,00 ;;
            Синупрет;377,00 ;;
            Ранкоф Рино;179,00 ;;
            Максифолор;459,00 ;;
            Гексорал;382,00 ;;
            Пакет;1,00 ;;
            Граммидин;308,00 ;;
            Триалгин;251,00 ;;
            Рыбий жир;229,00 ;;
            Витамин Е;71,00 ;;
            Глицерин;13,00 ;;
            Амбробене;144,00 ;;
            Синекод;323,00 ;;
            Бахилы медицинское;60,00 ;;
            Крымэнерго;;1 000,00 ;
            Вода Крыма;;1 000,00 ;
            КрымГаз;;800,00 ;
            Спорт. Костюм;1 800,00 ;;
            Майки ;480,00 ;;
            Кофта;750,00 ;;
            Футболка;550,00 ;;
            Носки;200,00;;
            Джинсы;1 600,00;;
            Штаны;1 500,00;;
            Саня - Алименты;11 000,00;;
            Саня - карманные;3 000,00;;
            Гель для стирки;549,00;;
            Гель для стирки;599,00;;
            Пакет;14,00;;
            Вода минеральная 1,5;87,00;;
            Пепси-кола;57,00;;
            Пепси-кола;73,00;;
            Пепси-кола;126,00;;
            Гель для стирки;84,00;;
            Масло растительное;168,00;;
            Деспенсер со скотчем;32,99;;
            Губки для кухни;59,00;;
            Батончик протеиновый;220,00;;
            Батончик протеиновый;267,00;;
            Чай в пакетиках;206,00;;
            Хлеб;34,00;;
            Хлопья Золотое зерно;198,00;;
            Мыло хозяйственное;49,00;;
            Хлопья Золотое зерно;198,00;;
            Чупа-чупс;93,00;;
            Корнишоны;169,80;;
            Салфетки для уборки;49,99;;
            Соль йодированная;34,90;;
            Мыло ;44,00;;
            Клей-карандаш;9,99;;
            Крупа Артек 700г;180,00;;
            Хлебцы;45,00;;
            Чипсы;49,00;;
            Гель для рук;64,00;;
            ;;;
            Пакет;12,20;;
            Чупа-чупс;54,00;;
            Чупа-чупс;54,00;;
            Корнишоны;169,80;;
            Туалетная бумага;69,00;;
            Туалетная бумага;69,00;;
            Ср-во для мытья посуды;59,00;;
            Туалетная бумага;69,00;;
            Средство для розжига;47,00;;
            Спички костровые;36,99;;
            Ср-во для мытья посуды;59,00;;
            Печенье;199,95;;
            Влажная туалетная бумага;109,00;;
            Сыр плавленный;74,99;;
            Печенье;25,00;;
            Сушка посольская;89,97;;
            Сыр плавленный;74,99;;
            Печенье;25,00;;
            Гель для рук;64,00;;
            Чипсы;84,00;;
            Чипся;84,00;;
            M&M`s;148,00;;
            M&M`s;148,00;;
            M&M`s;148,00;;
            ;;;
            ;;;
            Яблоко;3 761,00;;
            Маршрутка;34,00;;
            Маршрутка;34,00;;
            Яблоко;1 974,00;;
            Миранда-медиа;;299,00;
            Пакет;10,40;;
            Хлопья Золотое Зерно;297,00;;
            Хлопья Золотое Зерно;297,00;;
            Кока-кола;327,00;;
            Губка для обуви;44,00;;
            Губка для обуви;139,00;;
            Мыло;29,00;;
            Мыло;29,00;;
            Мыло;29,00;;
            Губка для обуви;99,00;;
            Чай в пакетиках;259,00;;
            Салфетки;118,00;;
            Протеиновый батончик 60 г;104,00;;
            Шоколад 60 г;69,00;;
            Протеиновый батончик 40 г;220,00;;
            Протеиновый батончик 60 г;104,00;;
            Протеиновый батончик 60 г;267,00;;
            M&M`s;148,00;;
            M&M`s;148,00;;
            M&M`s;148,00;;
            ;;;
            ;;;
            ;;;
            ;;;
            ;;;
            Степлер;108,00;;
            Батарейки ААА;70,00;;
            Скитллс;35,00;;
            Сиденье туриста;290,00;;
            Творог обезжиренный;219,98;;
            Сметана 15%;52,99;;
            Молоко 2,5%;91,99;;
            Сливки 10%;56,99;;
            Пакет;2,50;;
            Шоколад;29,50;;
            Хлеб;33,00;;
            Автокафе;200,00;;
            ;;;
            ;;;
            ;;;
            Пакет;10,40;;
            Хлопья Золотое Зерно;198,00;;
            Сахар;49,90;;
            Бумага;229,00;;
            Хлопья Кунцево;165,98;;
            Хлопья Любятово 600 г;119,00;;
            Соус майонезный;42,90;;
            Кукурузные палочки;39,98;;
            Зеленка в карандаше;60,00;;
            Йод в карандаше;60,00;;
            Скитллс;174,00;;
            M&M`s;74,00;;
            Батарейки 2032;124,00;;
            Мед 250 г;339,98;;
            M&M`s;148,00;;
            Лимонад;148,00;;
            Хлопья Золотое Зерно;198,00;;
            Пакет;5,20;;
            Пакет;10,00;;
            Хлопья Золотое Зерно;198,00;;
            Сыр плавленный Президент;96,99;;
            Сыр плавленный Президент;74,99;;
            Сыр плавленный Президент;96,99;;
            Сыр плавленный Президент;74,99;;
            Кока-кола 0 ккал;57,90;;
            Чупа=чупс;90,00;;
            Хлопья Доннель 800 г;139,80;;
            Творого обезжиренный;549,95;;
            Ополаскиватель для рта;164,00;;
            Щербет;49,99;;
            Семечки;69,00;;
            Семечки;114,00;;
            M&M`s;185,00;;
            Шоколад 60 г;139,00;;
            Скитллс;203,00;;
            Шоколад 60 г;79,00;;
            M&M`s;185,00;;
            Скитллс;177,00;;
            Сникерс;64,00;;
            Пакеты для муссора;99,98;;
            Ополаскиватель для рта;119,00;;
            Маршрутка;34,00;;
            Снимок зуба;350,00;;
            ;;;
            ;;;
            Пакет;2,50;;
            Куринные желудочки;149,11;;
            Дезедорант Old Spice;225,00;;
            Дезедорант Old Spice;225,00;;
            Туалетная бумага влажная ;109,00;;
            Балык ;245,07;;
            Сметана 15%;51,99;;
            Горошек консевированный;29,00;;
            Чипсы;84,00;;
            Батарейки 2032;248,00;;
            Скитллс;59,00;;
            ;;;
            Дрожжи пивные;98,00;;
            Дрожжи пивные;120,00;;
            Дрожжи пивные;120,00;;
            Назонекс;920,00;;
            Адам - карманные;350,00 ;;
            Артур - карманные;200,00 ;;
            Троллейбус;34,00;;
            Троллейбус;34,00;;
            Бумага А4;249,00;;
            Скитллс;254,28;;
            Фасоль консервированная;1 716,00;;
            Суп Yelli ;391,50;;
            Скитллс;33,89;;
            Горошек консервированный;1 080,00;;
            Лапша Доширак;38,49;;
            Лапша Доширак;76,98;;
            Чай Нури 100 пакетиков;109,00;;
            Балык Монастырский;830,00;;
            Кока-Кола 1,5  (18 бут);1 060,10;;
            Дирол ;23,99;;
            Бумажные платочки;111,00;;
            Суп Yelli ;129,00;;
            Кукуруза консервированная;1 320,00;;
            Пепси-кола 0,33 (12 бут);298,80;;
            Бумажные платочки;120,90;;
            Мандарины;74,30;;
            Кока-Кола 0,5 (24 бут);885,60;;
            Бумажные платочки;142,00;;
            Ментос;19,00;;
            Пепси-кола 0,33 (12 бут);298,80;;
            Швепс;606,49;;
            Пакет;5,20;;
            Насадка для швабры;149,00;;
            Носки мужские;85,00;;
            Носки мужские;85,00;;
            Носки мужские;85,00;;
            Носки мужские;85,00;;
            Носки мужские;85,00;;
            Емкость 3 л;65,00;;
            Биндеры;139,99;;
            Крпа Артек 700 г;72,00;;
            Биндеры;54,99;;
            Чипсы ;84,00;;
            Сахар;49,90;;
            Кофейные напиток;12,00;;
            Кофейные напиток;9,90;;
            Автокафе;290,00;;
            напитки;295,00;;
            Бензин;1 500,00;;
            Кабель зарядка Тип С;139,00;;
            Батончики;220,00;;
            ;;;
            Пакет;7,00;;
            Лосьон для бритья Old Spice;399,00;;
            Пакеты для мусора 60л;99,98;;
            Маркер ;26,99;;
            Гель для бритья;339,00;;
            Носки ;85,00;;
            Носки ;74,99;;
            Носки ;74,99;;
            Носки ;55,00;;
            Носки ;85,00;;
            Носки ;85,00;;
            Носки ;85,00;;
            Салфетки для уборки;159,98;;
            Приправа Паприка;53,80;;
            Приправа Корица;26,90;;
            Перчатки хоз. Резиновые;44,99;;
            Перчатки хоз. Резиновые;69,99;;
            Сливки 10%;113,98;;
            Шоколад;209,97;;
            Шоколад;209,97;;
            Шоколад;209,97;;
            Хлопья Золотое зерно;99,00;;
            Хлопья Золотое зерно;198,00;;
            Магнелис №90 ;610,00;;
            Фестал №40;270,00;;
            ;;;
            Пакет;10,00;;
            Емкость 2 л;118,00;;
            Емкость 1 л;110,00;;
            Нутелла;478,00;;
            Рис 900 ;107,80;;
            Сметана;51,99;;
            Хлеб;23,00;;
            Кофе Маккофе;36,00;;
            Кофе Маккофе;36,00;;
            Вафли;59,99;;
            Вафли;59,99;;
            Печенье;39,99;;
            Вафли;59,99;;
            ;;;
            Конфеты Джек;129,06;;
            Рис;161,70;;
            Пакет;10,40;;
            Сахар;51,80;;
            Каша рисовая консер.;76,00;;
            Туалетная бумага;69,00;;
            Килька;35,98;;
            Носки ;149,98;;
            Сгущенка;74,00;;
            Карамель;74,00;;
            Туалетная бумага;69,00;;
            Кукурма;62,90;;
            Фасоль стручковая;142,79;;
            Троллейбус;34,00;;
        ";

        #endregion

    }
}
